tutorials/incompressible/simpleFoam/motorBike/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.001;
        smoother         symGaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   ILU0;
        tolerance        1e-8;
        relTol           0.01;
    }
    k
    {
        solver           BiCGStab;
        preconditioner   ILU0;
        tolerance        1e-8;
        relTol           0.01;
    }
    omega
    {
        solver           BiCGStab;
        preconditioner   ILU0;
        tolerance        1e-8;
        relTol           0.01;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 2;
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    p               0.3;
    U               0.7;
    k               0.7;
    omega           0.7;
}

cache
{
    grad(U);
    grad(p);
    grad(k);
    grad(omega);
}

// ************************************************************************* //
